---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.IsAutoShadingForLoadDisplay
source: html/9668b833-8b16-6cc9-01dc-c04456cf3ed6.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.IsAutoShadingForLoadDisplay Property

Display shading of load cells automatically or not.

## Syntax (C#)
```csharp
public bool IsAutoShadingForLoadDisplay { get; set; }
```